/* Error reason when a service with a known application is invoked but another user has the application open */
"Another user has the \\U201C%@\\U201D application open." = "Ohjelma ”%@” on avoinna toisella käyttäjällä.";

/* Recovery suggestion when a service is invoked but the application is already open under another account */
"Ask the other user to quit the \\U201C%@\\U201D application, and then try again." = "Pyydä toista käyttäjää lopettamaan ohjelma ”%@” ja yritä uudelleen.";

/* Recovery suggestion when a service with a known application is invoked but the application is not compatible with the computer */
"Contact the vendor of \\U201C%@\\U201D for an updated version." = "Pyydä ohjelman ”%@” valmistajalta päivitetty versio.";

/* Recovery suggestion when a service is invoked but the user does not have permission to run the application */
"Contact your administrator for assistance." = "Pyydä ylläpitäjältä apua.";

/* NSTextReadInapplicableDocumentTypeError */
"Err65806" = "Tiedostoa ei voitu avata, koska sen muotoa ei tueta.";

/* NSTextWriteInapplicableDocumentTypeError */
"Err66062" = "Tiedostoa ei voitu tallentaa, koska sen muotoa ei tueta.";

/* A generic recovery suggestion displayed in an alert when an error occurs and there's no information about it. */
"No other information is available about the problem." = "Ongelmasta ei ole saatavilla lisätietoja.";

/* 'Show Application' recovery suggestion when a service request failed */
"Show Application" = "Näytä ohjelma";

/* 'Show Workflow' recovery suggestion when a workflow service request failed */
"Show Workflow" = "Näytä työnkulku";

/* Error description when some files cannot be duplicated (but others succeeded) because a miscellaneous error occurred. */
"Some files could not be duplicated because a miscellaneous error occurred (OSStatus %d)." = "Joitakin tiedostoja ei voitu monistaa, koska tapahtui luokittelematon virhe (OSStatus %d).";

/* Error description when some files cannot be duplicated (but others succeeded) because of a disk error. */
"Some files could not be duplicated because of a disk error." = "Joitakin tiedostoja ei voitu monistaa levyvirheen vuoksi.";

/* Error description when some files cannot be duplicated (but others succeeded) because the disk is full. */
"Some files could not be duplicated because the disk is full." = "Joitakin tiedostoja ei voitu monistaa, koska levy on täynnä.";

/* Error description when some files cannot be duplicated (but others succeeded) because the volume is write protected. */
"Some files could not be duplicated because the volume is write protected." = "Joitakin tiedostoja ei voitu monistaa, koska taltio on kirjoitussuojattu.";

/* Error description when some files cannot be duplicated (but others succeeded) because they were not found. */
"Some files could not be duplicated because they were not found." = "Joitakin tiedostoja ei voitu monistaa, koska niitä ei löytynyt.";

/* Error description when some files cannot be duplicated (but others succeeded) without giving a reason. */
"Some files could not be duplicated." = "Joitakin tiedostoja ei voitu monistaa.";

/* Error description when some files cannot be moved to the trash (but others succeeded) because a miscellaneous error occurred. */
"Some files could not be moved to the trash because a miscellaneous error occurred (OSStatus %d)." = "Joitakin tiedostoja ei voitu siirtää roskakoriin, koska tapahtui luokittelematon virhe (OSStatus %d).";

/* Error description when some files cannot be moved to the trash (but others succeeded) because of a disk error. */
"Some files could not be moved to the trash because of a disk error." = "Joitakin tiedostoja ei voitu siirtää roskakoriin levyvirheen vuoksi.";

/* Error description when some files cannot be moved to the trash (but others succeeded) because the disk is full. */
"Some files could not be moved to the trash because the disk is full." = "Joitakin tiedostoja ei voitu siirtää roskakoriin, koska levy on täynnä.";

/* Error description when some files cannot be moved to the trash (but others succeeded) because the disk is write protected. */
"Some files could not be moved to the trash because the disk is write protected." = "Joitakin tiedostoja ei voitu siirtää roskakoriin, koska levy on kirjoitussuojattu.";

/* Error description when some files cannot be moved to the trash (but others succeeded) because they were not found. */
"Some files could not be moved to the trash because they were not found." = "Joitakin tiedostoja ei voitu siirtää roskakoriin, koska niitä ei löytynyt.";

/* Error description when some files cannot be moved to the trash (but others succeeded) without giving a reason. */
"Some files could not be moved to the trash." = "Joitakin tiedostoja ei voitu siirtää roskakoriin.";

/* Error reason when a service with a known application is invoked but the application could not be found */
"The \\U201C%@\\U201D application could not be found." = "Ohjelmaa ”%@” ei löytynyt.";

/* Error reason when a service with a known application is invoked but the application could not be opened */
"The \\U201C%@\\U201D application could not be opened." = "Ohjelmaa ”%@” ei voitu avata.";

/* Error reason when an application did not provide valid data */
"The \\U201C%@\\U201D application did not provide valid data." = "Ohjelma ”%@” ei tarjonnut kelvollista dataa.";

/* Error reason when an application did not respond to a request for services */
"The \\U201C%@\\U201D application did not respond to the request for services." = "Ohjelma ”%@” ei vastannut pyyntöön palveluista.";

/* Error reason when a service with a known application is invoked but the application is corrupt */
"The \\U201C%@\\U201D application is corrupt." = "Ohjelma ”%@” on vioittunut.";

/* Error reason when a service with a known application is invoked but the application is in the trash */
"The \\U201C%@\\U201D application is in the Trash." = "Ohjelma ”%@” on roskakorissa.";

/* Error reason when a service with a known application is invoked but the application is not compatible with the computer */
"The \\U201C%@\\U201D application is not compatible with your computer." = "Ohjelma ”%@” ei ole yhteensopiva tietokoneen kanssa.";

/* Error reason when a service with a known application is invoked but the application requires a newer version of Mac OS X */
"The \\U201C%@\\U201D application requires a newer version of Mac OS X." = "Ohjelma ”%@” vaatii uudemman version Mac OS X:stä.";

/* Error description when a service is invoked but another user has the application open */
"The \\U201C%@\\U201D service could not be used because another user has the \\U201C%@\\U201D application open." = "Palvelua ”%1$@” ei voitu käyttää, koska toisella käyttäjällä on ohjelma ”%2$@” avoinna.";

/* Error description when a service with a known application is invoked but the application could not be found */
"The \\U201C%@\\U201D service could not be used because the \\U201C%@\\U201D application could not be found." = "Palvelua ”%1$@” ei voitu käyttää, koska ohjelmaa ”%2$@” ei löytynyt.";

/* Error description when a service with a known application is invoked but the application could not be opened */
"The \\U201C%@\\U201D service could not be used because the \\U201C%@\\U201D application could not be opened." = "Palvelua ”%1$@” ei voitu käyttää, koska ohjelmaa ”%2$@” ei voitu avata.";

/* Error description when a service with a known application is invoked but the application did not provide valid data */
"The \\U201C%@\\U201D service could not be used because the \\U201C%@\\U201D application did not provide valid data." = "Palvelua ”%1$@” ei voitu käyttää, koska ohjelma ”%2$@” ei tarjonnut kelvollista dataa.";

/* Error description when a service with a known application is invoked but the application did not respond to a request for services */
"The \\U201C%@\\U201D service could not be used because the \\U201C%@\\U201D application did not respond to a request for services." = "Palvelua ”%1$@” ei voitu käyttää, koska ohjelma ”%2$@” ei vastannut pyyntöön palveluista.";

/* Error description when a service is invoked but the application is corrupt */
"The \\U201C%@\\U201D service could not be used because the \\U201C%@\\U201D application is corrupt." = "Palvelua ”%1$@” ei voitu käyttää, koska ohjelma ”%2$@” on vioittunut.";

/* Error description when a service is invoked but the application is in the trash */
"The \\U201C%@\\U201D service could not be used because the \\U201C%@\\U201D application is in the Trash." = "Palvelua ”%1$@” ei voitu käyttää, koska ohjelma ”%2$@” on roskakorissa.";

/* Error description when a service is invoked but the application is not compatible with the computer */
"The \\U201C%@\\U201D service could not be used because the \\U201C%@\\U201D application is not compatible with your computer." = "Palvelua ”%1$@” ei voitu käyttää, koska ohjelma ”%2$@” ei ole yhteensopiva tietokoneen kanssa.";

/* Error description when a service is invoked but the application is in the trash */
"The \\U201C%@\\U201D service could not be used because the \\U201C%@\\U201D application requires a newer version of Mac OS X." = "Palvelua ”%1$@” ei voitu käyttää, koska ohjelma ”%2$@” vaatii uudemman version Mac OS X:stä.";

/* Error description when a workflow service is invoked but the workflow could not be found */
"The \\U201C%@\\U201D service could not be used because the \\U201C%@\\U201D workflow could not be found." = "Palvelua ”%1$@” ei voitu käyttää, koska työnkulkua ”%2$@” ei löytynyt.";

/* Error description when a workflow service timed out */
"The \\U201C%@\\U201D service could not be used because the \\U201C%@\\U201D workflow did not finish in time." = "Palvelua ”%1$@” ei voitu käyttää, koska työnkulku ”%2$@” ei valmistunut ajoissa.";

/* Error description when a workflow service did not provide valid data. */
"The \\U201C%@\\U201D service could not be used because the \\U201C%@\\U201D workflow did not provide valid data." = "Palvelua ”%1$@” ei voitu käyttää, koska työnkulku ”%2$@” ei tarjonnut kelvollista dataa.";

/* Error description when a service with an unknown application is invoked but the application could not be found */
"The \\U201C%@\\U201D service could not be used because the application could not be found." = "Palvelua ”%@” ei voitu käyttää, koska ohjelmaa ei löytynyt.";

/* Error description when a service with an unknown application is invoked but the application could not be opened */
"The \\U201C%@\\U201D service could not be used because the application could not be opened." = "Palvelua ”%@” ei voitu käyttää, koska ohjelmaa ei voitu avata.";

/* Error description when a service with an unknown application is invoked but the application did not respond to a request for services */
"The \\U201C%@\\U201D service could not be used because the application did not respond to a request for services." = "Palvelua ”%@” ei voitu käyttää, koska ohjelma ei vastannut pyyntöön palveluista.";

/* Error description when a service with a known application is invoked but there was a problem retrieving service information */
"The \\U201C%@\\U201D service could not be used because there was a problem retrieving service information from the \\U201C%@\\U201D application." = "Palvelua ”%1$@” ei voitu käyttää, koska haettaessa palvelutietoja ohjelmalta ”%2$@” tapahtui virhe.";

/* Error description when a workflow service is invoked but there was a problem retrieving service information. */
"The \\U201C%@\\U201D service could not be used because there was a problem retrieving service information from the \\U201C%@\\U201D workflow." = "Palvelua ”%1$@” ei voitu käyttää, koska noudettaessa palvelutietoja työnkululta ”%2$@” tapahtui virhe.";

/* Error description when a service with an unknown application is invoked but there was a problem retrieving service information */
"The \\U201C%@\\U201D service could not be used because there was a problem retrieving service information from the application." = "Palvelua ”%@” ei voitu käyttää, koska haettaessa palvelutietoja ohjelmalta tapahtui virhe.";

/* Error description when a service is invoked but the user does not have permission to run the application */
"The \\U201C%@\\U201D service could not be used because you do not have permission to open the \\U201C%@\\U201D application." = "Palvelua ”%1$@” ei voitu käyttää, koska sinulla ei ole oikeutta avata ohjelmaa ”%2$@”.";

/* Error description when a service is invoked but there was a miscellaneous problem */
"The \\U201C%@\\U201D service could not be used." = "Palvelua ”%@” ei voitu käyttää.";

/* Error reason when a service with a known workflow is invoked but the application could not be found */
"The \\U201C%@\\U201D workflow could not be found." = "Työnkulkua ”%@” ei löytynyt.";

/* Error reason when a workflow service timed out */
"The \\U201C%@\\U201D workflow did not finish in time." = "Työnkulku ”%@” ei valmistunut ajoissa.";

/* Failure reason when the app cannot be launched because of unknown errors. */
"The application \\U201C%@\\U201D could not be launched because a miscellaneous error occurred (OSStatus %d)." = "Ohjelmaa ”%1$@” ei voitu avata, koska tapahtui luokittelematon virhe (OSStatus %2$d).";

/* Failure reason when an application is corrupt. */
"The application \\U201C%@\\U201D could not be launched because it is corrupt." = "Ohjelmaa ”%@” ei voitu käynnistää, koska se on virheellinen.";

/* Failure reason when the app is in the trash. */
"The application \\U201C%@\\U201D could not be launched because it is in the Trash." = "Ohjelmaa ”%@” ei voitu käynnistää, koska se on roskakorissa.";

/* Failure reason when an application is not compatible with the computer. */
"The application \\U201C%@\\U201D could not be launched because it is not compatible with your computer." = "Ohjelmaa ”%@” ei voitu käynnistää, koska se ei ole yhteensopiva tietokoneen kanssa.";

/* Error description for when an app could not be launched */
"The application \\U201C%@\\U201D could not be launched because it was not found." = "Ohjelmaa ”%@” ei voitu käynnistää, koska sitä ei löytynyt.";

/* Error reason when a service with an unknown application is invoked but the application could not be found */
"The application could not be found." = "Ohjelmaa ei löytynyt.";

/* Error reason when a service with an unknown application is invoked but the application could not be opened */
"The application could not be opened." = "Ohjelmaa ei voitu avata.";

/* Error description for when an application is using a disk that the user tries to eject. */
"The disk could not be ejected because it is in use by \\U201C%@\\U201D." = "Levyä ei voida antaa, koska ”%@” käyttää sitä.";

/* Error description when a file cannot be duplicated because it was not found. */
"The file \\U201C%@\\U201D could not be duplicated because it was not found." = "Tiedostoa ”%@” ei voitu monistaa, koska sitä ei löytynyt.";

/* Error description when a file cannot be duplicated because of a disk error. */
"The file \\U201C%@\\U201D could not be duplicated because of a disk error." = "Tiedostoa ”%@” ei voitu monistaa levyvirheen vuoksi.";

/* Error description when a file cannot be duplicated because the disk is full. */
"The file \\U201C%@\\U201D could not be duplicated because the disk is full." = "Tiedostoa ”%@” ei voitu monistaa, koska levy on täynnä.";

/* Error description when a file cannot be duplicated because the volume is write protected. */
"The file \\U201C%@\\U201D could not be duplicated because the volume is write protected." = "Tiedostoa ”%@” ei voitu monistaa, koska taltio on kirjoitussuojattu.";

/* Error description when a file cannot be duplicated without giving a reason. */
"The file \\U201C%@\\U201D could not be duplicated." = "Tiedostoa ”%@” ei voitu monistaa.";

/* Error description when a file cannot be moved to the trash because it was not found. */
"The file \\U201C%@\\U201D could not be moved to the trash because a miscellaneous error occurred (OSStatus %d)." = "Tiedostoa ”%1$@” ei voitu siirtää roskakoriin, koska tapahtui luokittelematon virhe (OSStatus %2$d).";

/* Error description when a file cannot be moved to the trash because it was not found. */
"The file \\U201C%@\\U201D could not be moved to the trash because it was not found." = "Tiedostoa ”%@” ei voitu siirtää roskakoriin, koska sitä ei löytynyt.";

/* Error description when a file cannot be moved to the trash because of a disk error. */
"The file \\U201C%@\\U201D could not be moved to the trash because of a disk error." = "Tiedostoa ”%@” ei voitu siirtää roskakoriin levyvirheen vuoksi.";

/* Error description when a file cannot be moved to the trash because the disk is full. */
"The file \\U201C%@\\U201D could not be moved to the trash because the disk is full." = "Tiedostoa ”%@” ei voitu siirtää roskakoriin, koska levy on täynnä.";

/* Error description when a file cannot be moved to the trash because the volume is write protected. */
"The file \\U201C%@\\U201D could not be moved to the trash because the disk is write protected." = "Tiedostoa ”%@” ei voitu siirtää roskakoriin, koska levy on kirjoitussuojattu.";

/* Error description when a file cannot be moved to the trash without giving a reason. */
"The file \\U201C%@\\U201D could not be moved to the trash." = "Tiedostoa ”%@” ei voitu siirtää roskakoriin.";

/* Error description when all files cannot be duplicated because a miscellaneous error occurred. */
"The files could not be duplicated because a miscellaneous error occurred (OSStatus %d)." = "Tiedostoja ei voitu monistaa, koska tapahtui luokittelematon virhe (OSStatus %d).";

/* Error description when all files cannot be duplicated because of a disk error. */
"The files could not be duplicated because of a disk error." = "Tiedostoja ei voitu monistaa levyvirheen vuoksi.";

/* Error description when all files cannot be duplicated because the disk is full. */
"The files could not be duplicated because the disk is full." = "Tiedostoja ei voitu monistaa, koska levy on täynnä.";

/* Error description when all files cannot be duplicated because the volume is write protected. */
"The files could not be duplicated because the volume is write protected." = "Tiedostoja ei voitu monistaa, koska taltio on kirjoitussuojattu.";

/* Error description when all files cannot be duplicated because they were not found. */
"The files could not be duplicated because they were not found." = "Tiedostoja ei voitu monistaa, koska niitä ei löytynyt.";

/* Error description when all files cannot be duplicated without giving a reason. */
"The files could not be duplicated." = "Tiedostoja ei voitu monistaa.";

/* Error description when all files cannot be moved to the trash because a miscellaneous error occurred. */
"The files could not be moved to the trash because a miscellaneous error occurred (OSStatus %d)." = "Tiedostoja ei voitu siirtää roskakoriin, koska tapahtui luokittelematon virhe (OSStatus %d).";

/* Error description when all files cannot be moved to the trash because of a disk error. */
"The files could not be moved to the trash because of a disk error." = "Tiedostoja ei voitu siirtää roskakoriin levyvirheen vuoksi.";

/* Error description when all files cannot be moved to the trash because the disk is full. */
"The files could not be moved to the trash because the disk is full." = "Tiedostoja ei voitu siirtää roskakoriin, koska levy on täynnä.";

/* Error description when all files cannot be moved to the trash because the disk is write protected. */
"The files could not be moved to the trash because the disk is write protected." = "Tiedostoja ei voitu siirtää roskakoriin, koska levy on kirjoitussuojattu.";

/* Error description when all files cannot be moved to the trash because they were not found. */
"The files could not be moved to the trash because they were not found." = "Tiedostoja ei voitu siirtää roskakoriin, koska niitä ei löytynyt.";

/* Error description when all files cannot be moved to the trash without giving a reason. */
"The files could not be moved to the trash." = "Tiedostoja ei voitu siirtää roskakoriin.";

/* A generic error message displayed in an alert when an error occurs and there's no information about it. */
"The operation could not be completed." = "Toimintoa ei voitu suorittaa loppuun.";

/* Error description when an unknown service with an unknown application is invoked but the application did not provide valid data */
"The service could not be used because the application did not provide valid data." = "Palvelua ei voitu käyttää, koska ohjelma ei tarjonnut kelvollista dataa.";

/* Error reason when a service with a known application does not report its Services correctly */
"There was a problem retrieving service information from the \\U201C%@\\U201D application." = "Haettaessa palvelutietoja ohjelmalta ”%@” tapahtui virhe.";

/* Error reason when a workflow service does not report its Services correctly */
"There was a problem retrieving service information from the \\U201C%@\\U201D workflow." = "Noudettaessa palvelutietoja työnkululta ”%@” tapahtui virhe.";

/* Error reason when a service with an unknown application does not report its Services correctly */
"There was a problem retrieving service information from the application." = "Haettaessa palvelutietoja ohjelmalta tapahtui virhe.";

/* Recovery suggestion when a service with a known application is invoked but the application is in the trash */
"Try dragging \\U201C%@\\U201D from the Trash to your Applications folder." = "Vedä ohjelma ”%@” roskakorista Ohjelmat-kansioon.";

/* Recovery suggestion when a service is invoked but the application is corrupt
   Recovery suggestion when a service with a known application could not be found
   Recovery suggestion when a service with a known application could not be opened */
"Try reinstalling \\U201C%@.\\U201D" = "Asenna ohjelma ”%@” uudelleen.";

/* Recovery suggestion when a service with a known application does not report its Services correctly */
"Try reinstalling \\U201C%@\\U201D, or contact the vendor for an updated version." = "Asenna ohjelma ”%@” uudelleen tai pyydä valmistajalta päivitetty versio.";

/* Recovery suggestion when a service with an unknown application does not report its Services correctly */
"Try reinstalling the application, or contact the vendor for an updated version." = "Asenna ohjelma uudelleen tai pyydä valmistajalta päivitetty versio.";

/* Recovery suggestion when a service with an unknown application could not be found
   Recovery suggestion when a service with an unknown application could not be opened */
"Try reinstalling the application." = "Asenna ohjelma uudelleen.";

/* Recovery suggestion when an application did not respond to the request for services */
"Try reopening \\U201C%@,\\U201D or contact the vendor for an updated version." = "Avaa ohjelma ”%@” uudelleen tai pyydä valmistajalta päivitetty versio.";

/* Automator based recovery suggestion for a workflow Service.
   Recovery suggestion when a workflow service timed out. */
"Try running the \\U201C%@\\U201D workflow in Automator." = "Yritä suorittaa työnkulku ”%@” Automatorissa.";

/* Recovery suggestion when a service is invoked but the application requires a newer version of Mac OS X */
"Try using an older version of \\U201C%@,\\U201D or upgrade to a newer version of Mac OS X." = "Käytä vanhempaa versiota ohjelmasta ”%@” tai päivitä uudempaan Mac OS X -versioon.";

/* Recovery suggestion when an application did not respond to the request for services */
"Try using the service differently, or contact the vendor for an updated version of \\U201C%@.\\U201D" = "Käytä palvelua eri tavalla tai pyydä valmistajalta päivitetty versio ohjelmasta ”%@”.";

/* Error description when some files cannot be duplicated (but others succeeded) because  of a lack of permissions. */
"You do not have permission to duplicate some of the files." = "Sinulla ei ole oikeuksia monistaa osaa tiedostoista.";

/* Error description when a file cannot be duplicated because of a lack of permissions. */
"You do not have permission to duplicate the file \\U201C%@\\U201D." = "Sinulla ei ole oikeuksia monistaa tiedostoa ”%@”.";

/* Error description when all files cannot be duplicated because of a lack of permissions. */
"You do not have permission to duplicate the files." = "Sinulla ei ole oikeuksia monistaa tiedostoja.";

/* Error description when some files cannot be moved to the trash (but others succeeded) because of a lack of permissions. */
"You do not have permission to move some of the files to the trash." = "Sinulla ei ole oikeuksia siirtää joitakin tiedostoja roskakoriin.";

/* Error description when a file cannot be moved to the trash because of a lack of permissions. */
"You do not have permission to move the file \\U201C%@\\U201D to the trash." = "Sinulla ei ole oikeuksia siirtää tiedotoa ”%@” roskakoriin.";

/* Error description when all files cannot be moved to the trash because of a lack of permissions. */
"You do not have permission to move the files to the trash." = "Sinulla ei ole oikeuksia siirtää tiedostoja roskakoriin.";

/* Error reason when a service with a known application is invoked but the user does not have permission to run the application */
"You do not have permission to open the \\U201C%@\\U201D application." = "Sinulla ei ole oikeutta avata ohjelmaa ”%@”.";

/* Failure reason when the user lacks permission to run the app. */
"You do not have permission to run the application \\U201C%@\\U201D." = "Sinulla ei ole oikeuksia ohjelman ”%@” suorittamiseen.";

